app/controllers/admin/four_oh_fours_controller.rb

  def index
    @four_oh_fours = FourOhFour.order("#{$order} #{$ordem}")
                  .paginate(:per_page => session[:per_page],:page => params[:page])
---
SELECT `four_oh_fours`.* FROM `four_oh_fours`