app/controllers/admin/home_controller.rb

  def index
    #codigo exemplo
    @size = Menu.count
---
SELECT COUNT(*) FROM `menus`