app/controllers/admin/locations_controller.rb

  def index
    @locations = Location.where("name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => session[:per_page],:page => params[:page])
    @count = @locations.size
---
SELECT COUNT(*) FROM `locations` WHERE (street LIKE '%%')
SELECT `locations`.* FROM `locations` WHERE (street LIKE '%%') ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT `locations`.* FROM `locations`

  def show
    @location = Location.find(params[:id])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1

  def edit
    @location = Location.find(params[:id])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1

  def create
    @location = Location.new(params[:location])
    flash[:notice] = 'Localização criada com sucesso!' if @location.save
---
INSERT INTO `locations` (`street`, `number`, `district`, `city`, `state`, `uf`, `url_site`, `cep`, `phone`, `email`, `url_map`, `image_file_name`, `image_content_type`, `image_file_size`, `created_at`, `updated_at`) VALUES ('Rua Bahia', '250', '', '', '', '', '', '', '', 'lc_cezinha@hotmail.com', '', '654-6.jpg', 'image/jpeg', 41202, '2012-02-27 18:01:49', '2012-02-27 18:01:49')

  def update
    @location = Location.find(params[:id])
    flash[:notice] = 'Localização atualizado com sucesso!' if @location.update_attributes(params[:location])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
UPDATE `locations` SET `street` = 'Rua Centro Nova', `updated_at` = '2012-02-28 17:31:59' WHERE `locations`.`id` = 4

  def destroy
    @location = Location.find(params[:id])
    flash[:notice] = 'Localização deletado com sucesso' if @location.destroy
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
DELETE FROM `locations` WHERE `locations`.`id` = 2