app/controllers/admin/menus_controller.rb

  def index
    @menus = Menu.where("name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => params[:per_page],:page => params[:page])
    @count = @menus.size
---
SELECT COUNT(*) FROM `menus` WHERE (name LIKE '%%')
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc
SELECT `menus`.* FROM `menus` ORDER BY '---\n:position: asc\n'

  def show
    @menu = Menu.find(params[:id])
---
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc

  def new
    @menu = Menu.new
    @model_name = t("activerecord.models.menu.one")
---
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc

  def edit
    @menu = Menu.find(params[:id])
    @model_name = t("activerecord.models.menu.one")
---
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc
SELECT `menus`.* FROM `menus` ORDER BY '--- \n:position: asc\n'

  def create
    @menu = Menu.new(params[:menu])
    flash[:notice] = 'Menu criado com sucesso!' if @menu.save
---
INSERT INTO `menus` (`name`, `position`, `adm`, `situation`, `created_at`, `updated_at`) VALUES ('dsdsadasda', NULL, NULL, 1, '2012-03-05 13:15:14', '2012-03-05 13:15:14')

  def update
    @menu = Menu.find(params[:id])
    flash[:notice] = 'Menu atualizado com sucesso!' if @menu.update_attributes(params[:menu])
---
SELECT `menus`.* FROM `menus` WHERE `menus`.`id` = 8 LIMIT 1
UPDATE `menus` SET `name` = 'menuzão!!!', `updated_at` = '2012-03-16 14:56:50' WHERE `menus`.`id` = 8

  def destroy
    @menu = Menu.find(params[:id])
    flash[:notice] = 'Menu deletado com sucesso!' if @menu.destroy
---
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 6) ORDER BY position ASC
DELETE FROM `menus` WHERE `menus`.`id` = 6