app/controllers/admin/permissions_controller.rb

SELECT COUNT(*) FROM `permissions` WHERE (model_name LIKE '%%')
SELECT `permissions`.* FROM `permissions` WHERE (model_name LIKE '%%') ORDER BY id DESC LIMIT 30 OFFSET 0
---
  def index
    @permissions = Permission.where("model_name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => params[:per_page],:page => params[:page])