app/controllers/admin/roles_controller.rb

SELECT COUNT(*) FROM `roles` WHERE (name LIKE '%%')
SELECT `roles`.* FROM `roles` WHERE (name LIKE '%%') ORDER BY id DESC LIMIT 30 OFFSET 0
---
  def index
    @roles = Role.where("name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => params[:per_page],:page => params[:page])