app/controllers/admin/sub_menus_controller.rb

SELECT COUNT(*) FROM `sub_menus` WHERE (name LIKE '%%')
SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc
SELECT `menus`.* FROM `menus` ORDER BY '---\n:name: asc\n'
---
  def index
    @sub_menus = SubMenu.where("name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => session[:per_page],:page => params[:page])
    @count = @sub_menus.size

SELECT `sub_menus`.* FROM `sub_menus` WHERE `sub_menus`.`id` = 0 LIMIT 1
---
  def show
    @sub_menu = SubMenu.find(params[:id])

SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc
---
  def edit
    @sub_menu = SubMenu.find(params[:id])

INSERT INTO `sub_menus` (`menu_id`, `name`, `title`, `url`, `position`, `separator`, `adm`, `situation`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2012-03-07 20:30:06', '2012-03-07 20:30:06')
---
  def create
    @sub_menu = SubMenu.new(params[:sub_menu])
    flash[:notice] = 'SubMenu criado com sucesso!' if @sub_menu.save

SELECT `sub_menus`.* FROM `sub_menus` WHERE `sub_menus`.`id` = 23 LIMIT 1
UPDATE `sub_menus` SET `menu_id` = 5, `updated_at` = '2012-03-16 13:35:30' WHERE `sub_menus`.`id` = 23
---
  def update
    @sub_menu = SubMenu.find(params[:id])
    flash[:notice] = 'SubMenu atualizado com sucesso!' if @sub_menu.update_attributes(params[:sub_menu])

SELECT COUNT(*) FROM `menus` WHERE (name LIKE NULL)
SELECT `menus`.* FROM `menus` WHERE (name LIKE NULL) ORDER BY '--- \n:position: :asc\n' LIMIT 30 OFFSET 0
SELECT `menus`.* FROM `menus` ORDER BY '--- \n:position: :asc\n' LIMIT 30 OFFSET 0
SELECT `menus`.* FROM `menus` LIMIT 10 OFFSET 0
---
  def search
    @count = Menu.count
    if params[:search]
      @menus = Menu.where("name LIKE ?",params[:search]).order(:position => :asc).paginate(:per_page => session[:per_page],:page => params[:page])
    else
      @menus = Menu.order(:position => :asc).paginate(:per_page => session[:per_page],:page => params[:page])
    end
    @search_model_name = Menu.human_name.camelize
    logger.info("TO AQUI !!! #{@menus.size}")

SELECT `sub_menus`.* FROM `sub_menus` WHERE (`sub_menus`.menu_id = 1) ORDER BY position ASC, sub_menus.position asc
---
  def find_sub_menus_by_menu
     @sub_menus = SubMenu.all(:conditions => ["menu_id = ?", params[:menu]], :order => "position")

SELECT `sub_menus`.`id` FROM `sub_menus` WHERE (`sub_menus`.`name` = BINARY 'SUBBBBBBBBBBBbb') LIMIT 1
---
  def load_resources
    @menus = Menu.order(:name => "asc")