app/controllers/admin/users_controller.rb

  def index
    @users = User.where("name LIKE ?","%#{params[:search]}%")
                  .order("#{$order} #{$ordem}")
                  .paginate(:per_page => params[:per_page],:page => params[:page])#find_all_with_permission(params[:search],current_user)
    @count = @users.size
---
SELECT COUNT(*) FROM `users` WHERE (username LIKE '%%')
SELECT `users`.* FROM `users` WHERE (username LIKE '%%') ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY name ASC LIMIT 30 OFFSET 0

  def new
    @user = User.new
    @model_name = t("activerecord.models.user.one")
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new(params[:user])
    flash[:notice] = 'Usuário criado com sucesso!' if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `sign_in_count`, `current_sign_in_at`, `last_sign_in_at`, `current_sign_in_ip`, `last_sign_in_ip`, `username`, `situation`, `role_id`, `failed_attempts`, `unlock_token`, `locked_at`, `created_at`, `updated_at`) VALUES ('valter@gmaill.com', '$2a$10$yBofiI8/N03XcF6nLhuyNeBSz8TUMX7ToBGYna3bfw6Hsz4znNAG6', NULL, NULL, 0, NULL, NULL, NULL, NULL, 'valter', 1, 2, 0, NULL, NULL, '2012-02-29 14:26:17', '2012-02-29 14:26:17')

  def update
    @user = User.find(params[:id])
    flash[:notice] = 'Usuário atualizado com sucesso!' if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `username` = 'casanova', `email` = 'tiago@gmail.com', `encrypted_password` = '$2a$10$JeHp3DpZT6QhGsxh.KvFFuRuCsH5ydosxPJJy2JemvIOzr8Zxk2Fy', `role_id` = 2, `updated_at` = '2012-02-29 14:23:38' WHERE `users`.`id` = 2

  def destroy
    @user = User.find(params[:id])
    flash[:notice] = 'Usuário deletado com sucesso' if @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3

  def load_resources
    @roles = Role.order('value DESC')
---
SELECT `roles`.* FROM `roles` ORDER BY '---\n:value: DESC\n'